---
kind: other
id: Methods.T:Autodesk.Revit.DB.DirectContext3D.IndexStreamPoint
source: html/862c3856-7a1b-be92-e799-1fff297576de.htm
---
# IndexStreamPoint Methods

Inserts a IndexPoint into the stream and associated buffer.